[{"name":"Prógramm","title":"Hugbúnaðarsérfræðingur","href":"https://alfred.is/starf/hugbunadarserfraedingur-34","date":"","desc":"Prógramm leitar að framenda-, bakenda- og full-stack forriturum. Viðkomandi þarf að geta hafið störf sem fyrst.Ef þú ert áhugasamur og metnaðarfullur einstaklingur og tilbúinn til að taka að þér og leiða fjölbreytt og krefjandi verkefni þá áttu erindi við okkur.Helstu verkefni - Nýsmíði, viðhald og þróun nýrra hugbúnaðarkerfa - C# forritun, vefþjónustur - ASP.net vefir í Web Forms og MVC - Vefir í React - Client / server forritun stórra mikilvægra vinnslukerfa - Oracle forritun í PL/SQL og SQLPrógramm var stofnað 2007. Allt frá upphafi hafa markmið og gildi okkar verið þau sömu, einfaldleiki, nákvæmni og gleði. Prógramm á samstarf við fáa viðskiptavini en stóra og mikilvæga fyrir íslenskt samfélag. Við sérhæfum okkur í þróun og hönnun á sérsmíðuðum hugbúnaði.Prógramm er ört vaxandi fyrirtæki, fjárhagslega sterkt og býður upp á gott og fjölskylduvænt vinnuumhverfi.Við hvetjum konur jafnt sem karla til að sækja um. Einnig bjóðum við upp á fjarvinnuumhverfi og fögnum umsóknum utan höfuðborgarsvæðisins.Menntunar- og hæfniskröfur - 5 ára reynsla við hugbúnaðargerð skilyrði - Þekking á TypeScript - Þekking á React - Þekking á C# - Þekking á Oracle og MSSQL - Þekking á vefþjónustum, rest, graphql og soap - Geta unnið í teymi og hafa jákvætt og lausnamiðað viðhorfStarfsfríðindi - Sveigjanlegur vinnutími - Frábært mötuneyti og nasl milli mála - Öflugt starfsmannafélag - Íþróttastyrkur - Sturta og búningsklefi - Samgöngustyrkur","data":"2021-10-11T00:00:00Z"},{"name":"Festi","title":"Framendaforritari í upplýsingatæknideild","href":"https://alfred.is/starf/framendaforritari-i-upplysingataeknideild","date":"","deadline":"2021-10-24T23:59:59Z","desc":"Festi hf. leitar að framendaforritara í hugbúnaðarþróunarteymi fyrirtækisins sem hefur brennandi áhuga á starfrænni þróun í verslun og þjónustu.Við leitum að metnaðarfullum einstaklingi með menntun á sviði verk- eða tölvunarfræði sem er lausnamiðaður og góður í mannlegum samskiptum.Unnið er í teymum með innri og ytri aðilum að lausnum fyrir Festi og rekstrarfélög. Helstu verkefni eru áframhaldandi þróun á appi fyrir Snjallverslun Krónunnar.Hæfniskröfur - Reynsla og góð þekking á Flutter og React - Reynsla af app þróun fyrir Apple og Android - Þekking á AWS umhverfinu - Þekking á þjónustum ss. GraphQL og REST - Reynsla af Django, Python - Reynsla af Git og CICDÍ upplýsingatæknideild Festi starfa 16 manns við þróun og rekstur upplýsingakerfa. Við veitum starfsfólki sveigjanleika í starfi og leggjum áherslu á jafnvægi milli vinnu og einkalífs.Festi hf. er móðurfélag N1, Krónunnar, ELKO og Bakkans vöruhótels. Hjá Festi starfar öflugur hópur fagfólks á ýmsum sviðum sem þjónustar rekstrarfélögin í rekstri og framþróun.Umsóknarfrestur er til 24. október 2021Nánari upplýsingar veitir Linda Kristmannsdóttir Upplýsingatæknistjóri (linda@festi.is)Festi starfrækir vottað jafnlaunakerfi og hefur skuldbundið sig til að greiða jöfn laun fyrir sömu eða jafnverðmæt störf.Starfsfríðindi - Aðgangur að velferðarþjónustu Festi - Styrkur til heilsueflingar - Afsláttarkjör hjá N1, Krónunni og ELKO","data":"2021-10-07T16:53:16Z"},{"name":"Nox Health ","title":"Software Developer","href":"https://alfred.is/starf/software-developer-6","date":"","deadline":"2021-10-17T23:59:59Z","desc":"The Nox Health Cloud Development team is looking to expand and seek for a highly motivated individual, capable of working remotely in dispersed teams on delivering software products used by patients and providers of medical services.Responsibilities - User Interface (UI) development for the Nox Cloud platform - Close collaboration with remote UI design, testing and deployment teams - Analyse requirements and develop specifications with business analysts and stakeholders - Contribute to the software development processQualifications - BSc in Computer Science, Software Engineering or similar - Experience in front-end development using Angular/Typescript/CSS - Knowledge of best practice in agile software development such as Scrum and/or Kanban - Experience with relational DBs like PostgreSQL, MySQL or SQL Server as well as NoSQL databases such as MongoDB or Cassandra. - Experience with continuous integration and continuous delivery - Experience using git distributed version control system - Excellent English oral and written communication skillsThe right person for the role needs to thrive working remotely in distributed teams in a highly collaborative and fast-paced environment, while delivering pragmatic solutions to complex problems. Furthermore having the aptitude to learn new technologies and methodologies.","data":"2021-10-07T10:56:37Z"}]